import React, { useState } from "react";
import { Disclosure } from "@headlessui/react";
// import { ChevronUpIcon } from "@heroicons/react/solid";

export const Privacy = () => {
  const sections = [
    {
      title: "حریم خصوصی",
      content: `ویتسل متعهد است که حریم خصوصی شما را حفظ کند. در این بخش، ما اطلاعاتی را که از شما جمع آوری می کنیم و نحوه استفاده از آنها را شرح می دهیم. لطفا این بخش را با دقت مطالعه کنید و در صورت هرگونه سوال یا ابهام، با ما تماس بگیرید.`,
    },
    {
      title: "چه اطلاعاتی را جمع آوری می کنیم؟",
      content: `ما اطلاعات شخصی شما را در زمان های مختلف جمع آوری می کنیم، مانند زمان ثبت نام، خرید، ارسال نظر، پرداخت و یا استفاده از خدمات دیگر سایت. این اطلاعات شامل نام، نام خانوادگی، شماره تلفن، آدرس ایمیل، آدرس پستی، شماره کارت بانکی و سایر اطلاعات مربوط به حساب کاربری شما هستند. همچنین ما اطلاعات غیرشخصی شما را نیز جمع آوری می کنیم، مانند نوع مرورگر، سیستم عامل، آدرس IP و سایر داده های مربوط به استفاده شما از سایت.`,
    },
    {
      title: "چگونه از اطلاعات شما استفاده می کنیم؟",
      content: `ما از اطلاعات شخصی شما برای پاسخگویی به درخواست های شما، پردازش سفارش های شما، ارائه خدمات پس از فروش، ارسال خبرنامه ها و پیشنهادات ویژه، بهبود عملکرد و کارایی سایت و تحلیل رفتار کاربران استفاده می کنیم. ما همچنین ممکن است با استفاده از اطلاعات شخصی شما با شما تماس بگیریم تا نظرات و پیشنهادات شما را درباره سایت و خدمات ما بدانیم. ما از اطلاعات غیرشخصی شما برای بهبود تجربه کاربران و تولید گزارش های آماری استفاده می کنیم.`,
    },
    {
      title: "چگونه اطلاعات شما را حفظ می کنیم؟",
      content: `دسترسي به حساب كاربري شخصي كاربران فقط با استفاده از كليد (كليده) منحصر به فردي كاربران ممكن است. اين كليدها شامل نام كاربري و كلمه عبور مي باشد. كاربران موظف هستند كه از اين كليدها محافظت نمايند و آنها را در اختيار ديگران قرار ندهند. ما از تكنولوژي هاي مناسب براي حفاظت از اطلاعات شما استفاده مي كنيم و به طور منظم سيستم هاي خود را براي جلوگيري از هرگونه نفوذ و سوء استفاده بررسي مي كنيم. با اين حال، هيچ روش انتقال يا ذخيره سازي داده ها قابل اطمينان نمی باشد و ما نمی توانیم تضمین کنیم که اطلاعات شما در برابر هکرها و سایر عوامل خارجی محافظت شوند.`,
    },
  ];

  return (
    <div className="w-full  p-2 mx-auto bg-white rounded-2xl">
      <div className="text-2xl font-bold text-center text-red-600">
        حریم خصوصی
      </div>
      <div className="mt-4 space-y-2">
        {sections.map((section, index) => (
          <Disclosure key={index}>
            {({ open }) => (
              <>
                <Disclosure.Button className="flex justify-between w-full px-4 py-2 text-sm font-medium text-left text-red-600 bg-red-100 rounded-lg hover:bg-red-200 focus:outline-none focus-visible:ring focus-visible:ring-purple-500 focus-visible:ring-opacity-75">
                  <span>{section.title}</span>
                  {/* <ChevronUpIcon
className={`${
open ? "transform rotate-180" : ""
} w-5 h-5 text-red-500`}
/> */}
                </Disclosure.Button>
                <Disclosure.Panel className="px-4 pt-4 pb-2 text-sm text-gray-500">
                  {section.content}
                </Disclosure.Panel>
              </>
            )}
          </Disclosure>
        ))}
      </div>
    </div>
  );
};
